/* automatically generated by rust-bindgen 0.59.2 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const WASMEDGE_VERSION: &[u8; 6usize] = b"0.9.1\0";
pub const WASMEDGE_VERSION_MAJOR: u32 = 0;
pub const WASMEDGE_VERSION_MINOR: u32 = 9;
pub const WASMEDGE_VERSION_PATCH: u32 = 1;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub const WasmEdge_Proposal_ImportExportMutGlobals: WasmEdge_Proposal = 0;
pub const WasmEdge_Proposal_NonTrapFloatToIntConversions: WasmEdge_Proposal = 1;
pub const WasmEdge_Proposal_SignExtensionOperators: WasmEdge_Proposal = 2;
pub const WasmEdge_Proposal_MultiValue: WasmEdge_Proposal = 3;
pub const WasmEdge_Proposal_BulkMemoryOperations: WasmEdge_Proposal = 4;
pub const WasmEdge_Proposal_ReferenceTypes: WasmEdge_Proposal = 5;
pub const WasmEdge_Proposal_SIMD: WasmEdge_Proposal = 6;
pub const WasmEdge_Proposal_TailCall: WasmEdge_Proposal = 7;

pub const WasmEdge_ErrCode_FuncSigMismatch: WasmEdge_ErrCode = 131;
pub const WasmEdge_ErrCode_DivideByZero: WasmEdge_ErrCode = 132;
pub const WasmEdge_ErrCode_IntegerOverflow: WasmEdge_ErrCode = 133;
pub const WasmEdge_ErrCode_InvalidConvToInt: WasmEdge_ErrCode = 134;
pub const WasmEdge_ErrCode_TableOutOfBounds: WasmEdge_ErrCode = 135;
pub const WasmEdge_ErrCode_MemoryOutOfBounds: WasmEdge_ErrCode = 136;
pub const WasmEdge_ErrCode_Unreachable: WasmEdge_ErrCode = 137;
pub const WasmEdge_ErrCode_UninitializedElement: WasmEdge_ErrCode = 138;
pub const WasmEdge_ErrCode_UndefinedElement: WasmEdge_ErrCode = 139;
pub const WasmEdge_ErrCode_IndirectCallTypeMismatch: WasmEdge_ErrCode = 140;
pub const WasmEdge_ErrCode_ExecutionFailed: WasmEdge_ErrCode = 141;
pub const WasmEdge_ErrCode_RefTypeMismatch: WasmEdge_ErrCode = 142;
#[doc = " Error code C enumeration."]
pub type WasmEdge_ErrCode = ::std::os::raw::c_uint;
pub const WasmEdge_ValType_I32: WasmEdge_ValType = 127;
pub const WasmEdge_ValType_I64: WasmEdge_ValType = 126;
pub const WasmEdge_ValType_F32: WasmEdge_ValType = 125;
pub const WasmEdge_ValType_F64: WasmEdge_ValType = 124;
pub const WasmEdge_ValType_V128: WasmEdge_ValType = 123;
pub const WasmEdge_ValType_FuncRef: WasmEdge_ValType = 112;
pub const WasmEdge_ValType_ExternRef: WasmEdge_ValType = 111;
#[doc = " WASM Value type C enumeration."]
pub type WasmEdge_ValType = ::std::os::raw::c_uint;
pub const WasmEdge_NumType_I32: WasmEdge_NumType = 127;
pub const WasmEdge_NumType_I64: WasmEdge_NumType = 126;
pub const WasmEdge_NumType_F32: WasmEdge_NumType = 125;
pub const WasmEdge_NumType_F64: WasmEdge_NumType = 124;
pub const WasmEdge_NumType_V128: WasmEdge_NumType = 123;
#[doc = " WASM Number type C enumeration."]
pub type WasmEdge_NumType = ::std::os::raw::c_uint;
pub const WasmEdge_RefType_FuncRef: WasmEdge_RefType = 112;
pub const WasmEdge_RefType_ExternRef: WasmEdge_RefType = 111;
#[doc = " WASM Reference type C enumeration."]
pub type WasmEdge_RefType = ::std::os::raw::c_uint;
pub const WasmEdge_Mutability_Const: WasmEdge_Mutability = 0;
pub const WasmEdge_Mutability_Var: WasmEdge_Mutability = 1;
#[doc = " WASM Mutability C enumeration."]
pub type WasmEdge_Mutability = ::std::os::raw::c_uint;
pub const WasmEdge_ExternalType_Function: WasmEdge_ExternalType = 0;
pub const WasmEdge_ExternalType_Table: WasmEdge_ExternalType = 1;
pub const WasmEdge_ExternalType_Memory: WasmEdge_ExternalType = 2;
pub const WasmEdge_ExternalType_Global: WasmEdge_ExternalType = 3;
#[doc = " WASM External type C enumeration."]
pub type WasmEdge_ExternalType = ::std::os::raw::c_uint;
pub type uint128_t = u128;
pub type int128_t = i128;
#[doc = " WasmEdge WASM value struct."]
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Value {
    pub Value: uint128_t,
    pub Type: WasmEdge_ValType,
}
#[test]
fn bindgen_test_layout_WasmEdge_Value() {
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Value>(),
        32usize,
        concat!("Size of: ", stringify!(WasmEdge_Value))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Value>(),
        16usize,
        concat!("Alignment of ", stringify!(WasmEdge_Value))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_Value>())).Value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Value),
            "::",
            stringify!(Value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_Value>())).Type as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Value),
            "::",
            stringify!(Type)
        )
    );
}
#[doc = " WasmEdge string struct."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_String {
    pub Length: u32,
    pub Buf: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_WasmEdge_String() {
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_String>(),
        16usize,
        concat!("Size of: ", stringify!(WasmEdge_String))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_String>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_String))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_String>())).Length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_String),
            "::",
            stringify!(Length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_String>())).Buf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_String),
            "::",
            stringify!(Buf)
        )
    );
}
#[doc = " Opaque struct of WASM execution result."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Result {
    pub Code: u8,
}
#[test]
fn bindgen_test_layout_WasmEdge_Result() {
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Result>(),
        1usize,
        concat!("Size of: ", stringify!(WasmEdge_Result))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Result>(),
        1usize,
        concat!("Alignment of ", stringify!(WasmEdge_Result))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_Result>())).Code as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Result),
            "::",
            stringify!(Code)
        )
    );
}
#[doc = " Struct of WASM limit."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Limit {
    #[doc = " Boolean to describe has max value or not."]
    pub HasMax: bool,
    #[doc = " Minimum value."]
    pub Min: u32,
    #[doc = " Maximum value. Will be ignored if the `HasMax` is false."]
    pub Max: u32,
}
#[test]
fn bindgen_test_layout_WasmEdge_Limit() {
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Limit>(),
        12usize,
        concat!("Size of: ", stringify!(WasmEdge_Limit))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Limit>(),
        4usize,
        concat!("Alignment of ", stringify!(WasmEdge_Limit))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_Limit>())).HasMax as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(HasMax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_Limit>())).Min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(Min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WasmEdge_Limit>())).Max as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(Max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ConfigureContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_StatisticsContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ASTModuleContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_FunctionTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_MemoryTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_TableTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_GlobalTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ImportTypeContext {
